In [1]:
import pandas as pd

items = [{'bikes' : 20, 'pants' : 30, 'watches' : 35},
         {'watches' : 10, 'glasses' : 50, 'bikes' : 15, 'pants' : 5}]

store_items = pd.DataFrame(items, index = ['store 1', 'store 2'])

store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

In [3]:
# We access row, columns, elemnts using labels:
print()
print('How many bikes are in each store: \n', store_items[['bikes']])
print()
print('How many bikes and pants are at each store: \n', store_items[['bikes', 'pants']])
print()
print('How many items are in store 1: \n', store_items.loc[['store 1']])
print()
print('How many bikes are in store 2: \n', store_items['bikes']['store 2'])
print()

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are at each store:
          bikes  pants
store 1     20     30
store 2     15      5

How many items are in store 1:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

How many bikes are in store 2:
 15

In [4]:
# We can add a new column named shirts to our store_items DataFrame, indicating the number of shirts for each store
store_items['shirts'] = [15, 2]

store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

In [5]:
# We can add columns by using arithmetic operatioins between other columns:
store_items['suits'] = store_items['pants'] + store_items['shirts']

store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

In [9]:
# We can also add rows, for instance, if we add a new store:
new_items = [{'bikes' : 20, 'pants' : 30, 'watches' : 35, 'glasses' : 4}]

new_store = pd.DataFrame(new_items, index = ['store 3'])

new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [7]:
# now we can append it to the previous DataFrame:
store_items = store_items.append(new_store)

store_items

/home/kinant/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [11]:
# we can choose to "stock" certain stores by only selecting certain row
store_items['new watches'] =  store_items['watches'][1:]

store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

In [13]:
# We can insert new columns anywhere we want:
store_items.insert(4, 'shoes', [8, 5, 0])

store_items

ValueError: cannot insert shoes, already exists

In [14]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

In [15]:
# We can also delete rows and columns:
store_items.pop('new watches')

store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [16]:
# We remove the watches and shoes column:
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [17]:
# We remove the store 1 and 2 rows:
store_items = store_items.drop(['store 1', 'store 2'], axis = 0)

In [18]:
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

In [19]:
# we can rename/change row and column labels:
store_items = store_items.rename(columns = {'bikes' : 'hats'})

store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [20]:
# Now we change a row label
store_items = store_items.rename(index = {'store 3' : 'last store'})

store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [21]:
# we can also change the index:
store_items = store_items.set_index('pants')

store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN